<?php

namespace App\Game\TicTac\GameBoard;


class Board4x4 extends Board
{

    protected function getSize(): int
    {
       return 4;
    }

    protected function getWinnerCoordinates(): array
    {
        return [
            // Проверка по горизонтали и вертикали
            [[0, 0], [0, 1], [0, 2]],
            [[1, 0], [1, 1], [1, 2]],
            [[2, 0], [2, 1], [2, 2]],
            [[3, 0], [3, 1], [3, 2]],

            [[0, 1], [0, 2], [0, 3]],
            [[1, 1], [1, 2], [1, 3]],
            [[2, 1], [2, 2], [2, 3]],
            [[3, 1], [3, 2], [3, 3]],

            // Проверка по вертикали
            [[0, 0], [1, 0], [2, 0]],
            [[0, 1], [1, 1], [2, 1]],
            [[0, 2], [1, 2], [2, 2]],
            [[0, 2], [1, 3], [2, 3]],

            [[1, 0], [2, 0], [3, 0]],
            [[1, 1], [2, 1], [3, 1]],
            [[1, 2], [2, 2], [3, 2]],
            [[1, 2], [2, 3], [3, 3]],

            // Проверка по диагонали (левая верхняя - правая нижняя)
            [[0, 0], [1, 1], [2, 2]],
            [[1, 1], [2, 2], [3, 3]],
            [[0, 1], [1, 2], [2, 3]],
            [[1, 0], [2, 1], [3, 2]],

            // Проверка по диагонали (правая верхняя - левая нижняя)
            [[0, 2], [1, 1], [2, 0]],
            [[1, 2], [2, 1], [3, 0]],
            [[0, 3], [1, 2], [2, 1]],
            [[1, 3], [2, 2], [3, 1]],

        ];

    }
}
